///
///Класс Stack должен иметь:
  ///  закрытый целочисленный фиксированный массив длиной 10 элементов;
    ///  закрытое целочисленное значение для отслеживания длины стека;
    ///  открытый метод с именем reset(), который будет инициализировать значением 0 длину и все значения элементов;
    ///  открытый метод с именем push(), который будет добавлять значение в стек.Метод push() должен возвращать значение false, если массив уже заполнен, в противном случае — true;
    ///  открытый метод с именем pop() для возврата значений из стека.Если в стеке нет значений, то должен выводиться стейтмент assert;
    /// открытый метод с именем print(), который будет выводить все значения стека.
/// 

#include "Stack.h"

int main()
{
    Stack stack;
    stack.reset();
    stack.print();

    stack.push(3);
    stack.push(7);
    stack.push(5);
    stack.push(3);
    stack.push(7);
    stack.push(51);
    stack.push(3);
    stack.push(7);
    stack.push(5);
    stack.push(9);
    stack.push(9); // не будет выводится 
    stack.print();

    stack.pop();
    stack.pop();
    stack.pop();
    stack.pop();
    stack.pop();
    stack.pop();
    stack.pop();
    stack.pop();
    stack.pop();
    stack.pop();  // выведет последний элемент  = 3
    //stack.pop(); // исключение , вызов ошибки!
    stack.print();
  
    return 0;
}

